emacs/config.el
;; Increase GC threshold during startup (prevents excessive GCs)
(setq gc-cons-threshold most-positive-fixnum
      gc-cons-percentage 0.6)

;; Disable file name handlers during startup (big speed boost)
(defvar batunii--file-name-handler-alist file-name-handler-alist)
(setq file-name-handler-alist nil)

;; Restore after Elpaca finishes (not just emacs-startup-hook)
(add-hook 'elpaca-after-init-hook
          (lambda ()
            (setq gc-cons-threshold (* 20 1024 1024)  ; 16MB
                  gc-cons-percentage 0.1
                  file-name-handler-alist batunii--file-name-handler-alist)))

;; Fallback: also restore on emacs-startup-hook if elpaca hook doesn't exist
(add-hook 'emacs-startup-hook
          (lambda ()
            (setq gc-cons-threshold (* 20 1024 1024)
                  gc-cons-percentage 0.1
                  file-name-handler-alist batunii--file-name-handler-alist)))

;; Don't compact font caches during GC
(setq inhibit-compacting-font-caches t)

;; Reduce frame resize overhead during startup
(setq frame-inhibit-implied-resize t)

;; Increase amount of data Emacs reads from processes
(setq read-process-output-max (* 1024 1024))  ; 1MB

(defvar elpaca-installer-version 0.11)
(defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
(defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                              :ref nil :depth 1 :inherit ignore
                              :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                              :build (:not elpaca--activate-package)))
(let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
       (build (expand-file-name "elpaca/" elpaca-builds-directory))
       (order (cdr elpaca-order))
       (default-directory repo))
  (add-to-list 'load-path (if (file-exists-p build) build repo))
  (unless (file-exists-p repo)
    (make-directory repo t)
    (when (<= emacs-major-version 28) (require 'subr-x))
    (condition-case-unless-debug err
        (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                  ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                  ,@(when-let* ((depth (plist-get order :depth)))
                                                      (list (format "--depth=%d" depth) "--no-single-branch"))
                                                  ,(plist-get order :repo) ,repo))))
                  ((zerop (call-process "git" nil buffer t "checkout"
                                        (or (plist-get order :ref) "--"))))
                  (emacs (concat invocation-directory invocation-name))
                  ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                        "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                  ((require 'elpaca))
                  ((elpaca-generate-autoloads "elpaca" repo)))
            (progn (message "%s" (buffer-string)) (kill-buffer buffer))
          (error "%s" (with-current-buffer buffer (buffer-string))))
      ((error) (warn "%s" err) (delete-directory repo 'recursive))))
  (unless (require 'elpaca-autoloads nil t)
    (require 'elpaca)
    (elpaca-generate-autoloads "elpaca" repo)
    (let ((load-source-file-function nil)) (load "./elpaca-autoloads"))))
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))

(elpaca elpaca-use-package
  (elpaca-use-package-mode))

(use-package emacs 
  :ensure nil 
  :config 
  (setq ring-bell-function #'ignore)
  (setq shift-select-mode nil)
  (setq org-support-shift-select nil))

(use-package evil 
  :ensure (:wait t)
  :init
  (setq evil-want-integration t
        evil-want-keybinding nil
        evil-want-minibuffer t
        evil-vsplit-window-right t
        evil-split-window-below t
	  evil-undo-system 'undo-redo)
  :config
  (evil-mode 1))

(use-package evil-collection 
  :ensure (:wait t)
  :after evil
  :config
  (setq evil-collection-mode-list '(dashboard dired ibuffer xref minibuffer))
  (setq evil-collection-want-unimpaired-p nil)
  (evil-collection-init))

(use-package general 
  :ensure (:wait t)
  :config
  (general-evil-setup)
  
  (general-create-definer batunii/leader-keys
    :states '(normal insert visual emacs)
    :keymaps 'override
    :prefix "SPC"
    :global-prefix "M-SPC"))

(batunii/leader-keys
  "b"  '(:ignore t :wk "buffer")
  "bb" '(switch-to-buffer :wk "Switch buffer")
  "bk" '(kill-current-buffer :wk "Kill buffer")
  "bn" '(next-buffer :wk "Next buffer")
  "bp" '(previous-buffer :wk "Prev buffer")
  "br" '(revert-buffer :wk "Reload buffer"))

(batunii/leader-keys
  "w"  '(:ignore t :wk "window")
  "ws" '(split-window-below :wk "Split below")
  "wv" '(split-window-right :wk "Split right")
  "wk" '(delete-window :wk "Delete window"))

(batunii/leader-keys
  "l"  '(:ignore t :wk "lsp")
  "ld" '(lsp-find-definition :wk "Go to definition")
  "lD" '(lsp-find-references :wk "Find references")
  "lr" '(lsp-rename :wk "Rename symbol")
  "lf" '(lsp-format-buffer :wk "Format buffer")
  "lh" '(batunii/lsp-show-doc :wk "Show docs")
  "ln" '(flymake-goto-next-error :wk "Next diagnostic")
  "lp" '(flymake-goto-prev-error :wk "Prev diagnostic")
  "le" '(batunii/show-error-at-point :wk "Error at point"))

(batunii/leader-keys
  "sr" '(query-replace :wk "Query replace")
  "e" '(treemacs :wk "Treemacs")
  "cc" '(compile :wk "Compile")
  )

;; Set default frame parameters (applies to all frames)
(setq default-frame-alist
      '((font . "JetBrainsMono Nerd Font-15")))  ; Note: size is part of font string

;; Additional font settings
(set-face-attribute 'variable-pitch nil
                    :font "JetBrainsMono Nerd Font"
                    :height 190
                    :weight 'medium)

(set-face-attribute 'fixed-pitch nil
                    :font "JetBrainsMono Nerd Font Mono"
                    :height 180
                    :weight 'medium)

(set-face-attribute 'font-lock-comment-face nil :slant 'italic)
(set-face-attribute 'font-lock-keyword-face nil :weight 'bold :slant 'italic)

(use-package catppuccin-theme
  :ensure t
  :custom
  (catppuccin-italic-comments t)
  (catppuccin-italic-variables nil)
  (catppuccin-italic-blockquotes t)
  (catppuccin-flavor 'mocha)
  
  :config
  (load-theme 'catppuccin :no-confirm)
  
  ;; Override background colors
  (catppuccin-set-color 'base "#181818")
  (catppuccin-set-color 'mantle "#282828")
  (catppuccin-set-color 'crust "#282828")
  
  (catppuccin-reload))

(menu-bar-mode -1)
(tool-bar-mode -1)
