emacs/config.org
** Interface Cleanup
#+begin_src emacs-lisp
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (set-frame-parameter nil 'undecorated t) ; Remove window decorations
#+end_src

** Line Numbers
#+begin_src emacs-lisp
(setq display-line-numbers-type 'relative)
(global-display-line-numbers-mode +1)
(global-visual-line-mode t)
#+end_src

** Which-key
#+begin_src emacs-lisp
  (use-package which-key
    :ensure t
    :diminish (which-key-mode)
    :init
    (which-key-mode 1)
    :config
    (setq which-key-side-window-location 'bottom
          which-key-sort-order #'which-key-key-order-alpha
          which-key-idle-delay 0.8
          which-key-max-description-length 25))
#+end_src

** Dashboard
#+begin_src emacs-lisp
(use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook)
  (setq dashboard-startup-banner "~/.config/emacs/ascii.txt"
        dashboard-center-content t
        dashboard-items '((recents . 10))
        dashboard-set-heading-icons t
        dashboard-set-file-icons t
        dashboard-banner-logo-title "Welcome to redmacs"
        initial-buffer-choice (lambda () (get-buffer-create "*dashboard*"))))
#+end_src

* ORG MODE
** Table of Contents Generator
#+begin_src emacs-lisp
(use-package toc-org
  :ensure t
  :hook (org-mode . toc-org-enable))
#+end_src

** Visual Improvements
#+begin_src emacs-lisp
(add-hook 'org-mode-hook #'org-indent-mode)

(use-package org-bullets
  :ensure t
  :after org
  :hook (org-mode . org-bullets-mode))
#+end_src

* PROGRAMMING
** Tree-sitter
#+begin_src emacs-lisp
(when (and (fboundp 'treesit-available-p)
           (treesit-available-p))
  (setq major-mode-remap-alist
        '((python-mode . python-ts-mode)
          (c-mode      . c-ts-mode)
          (c++-mode    . c++-ts-mode)
          (js-mode     . js-ts-mode)
          (css-mode    . css-ts-mode)
          (json-mode   . json-ts-mode)))
  
  (setq treesit-font-lock-level 4))
#+end_src

** LSP Mode
#+begin_src emacs-lisp
  (use-package lsp-pyright
    :ensure t
    :after lsp-mode
    :hook (python-ts-mode . lsp-pyright))
    (use-package lsp-mode
      :ensure t
      :commands lsp
      :diminish (lsp-mode . " LSP")
      :hook ((python-ts-mode . lsp)
             (c-ts-mode . lsp)
             (c++-ts-mode . lsp)
             (js-ts-mode . lsp)
             (lsp-mode . lsp-headerline-breadcrumb-mode)
             (lsp-headerline-breadcrumb-mode . batunii/lsp-modeline-setup))
      :init
      (setq lsp-keymap-prefix "C-c l")
      :custom
      (read-process-output-max (* 1024 1024))
      :config
      (lsp-enable-which-key-integration)
     (setq lsp-diagnostic-level :error) 
      ;; Breadcrumb configuration
      (setq lsp-headerline-breadcrumb-enable t
            lsp-headerline-breadcrumb-segments '(symbols))
      
      ;; Signature and documentation settings
      (setq lsp-signature-auto-activate t
            lsp-signature-render-documentation nil
            lsp-eldoc-enable-signature-help t
            eldoc-idle-delay 0.1
            eldoc-echo-area-use-multiline-p t
            max-mini-window-height 0.5)
      
      ;; Clean up mode-line
      (setq lsp-modeline-code-actions-enable nil
            lsp-modeline-diagnostics-enable nil
            lsp-modeline-workspace-status-enable nil)

    )
  (use-package apheleia
    :ensure t)

    ;; Move breadcrumbs to mode-line
    (defun batunii/lsp-modeline-setup ()
      "Move LSP breadcrumbs to mode-line after buffer name."
      (setq-local header-line-format nil)
      (setq-local mode-line-format
                  (list
                   ;; Left side
                   "%e"
                   mode-line-front-space
                   mode-line-mule-info
                   mode-line-client
                   mode-line-modified
                   mode-line-remote
                   mode-line-frame-identification
                   mode-line-buffer-identification
                   " "
                    'vc-mode
                   ;; LSP Breadcrumbs
                   '(:eval (when lsp-headerline-breadcrumb-mode
                             (lsp-headerline--build-string)))
  		  " "
                    mode-line-position
  		  " "
                   ;; Right side
                   mode-line-position
                   (vc-mode vc-mode)
                   " "
                   mode-line-modes
                   mode-line-misc-info
                   mode-line-end-spaces)))

    ;; Show docs in minibuffer
    (defun batunii/lsp-show-doc ()
      "Show LSP documentation in minibuffer."
      (interactive)
      (if (lsp-feature? "textDocument/hover")
          (let* ((hover-info (lsp-request "textDocument/hover" (lsp--text-document-position-params)))
                 (contents (when hover-info (gethash "contents" hover-info)))
                 (doc (when contents
                        (if (stringp contents)
                            contents
                          (lsp--render-element contents)))))
            (if doc
                (message "%s" doc)
              (message "No documentation available")))
        (message "LSP hover not supported")))
#+end_src

** Diagnostics
#+begin_src emacs-lisp
  (use-package flymake
    :ensure nil
    :diminish flymake-mode
    :hook (prog-mode . flymake-mode))

  (defun batunii/show-error-at-point ()
    "Display Flymake diagnostic at cursor."
    (interactive)
    (let* ((diags (flymake-diagnostics (point)))
           (msg   (mapconcat #'flymake-diagnostic-text diags " | ")))
      (if (string-empty-p msg)
          (message "No diagnostic at point.")
        (message "%s" msg))))
#+end_src


*** Treemacs
#+begin_src emacs-lisp
  (use-package hydra
  :ensure t)

(use-package treemacs
  :ensure t)

  (use-package lsp-treemacs
  :ensure t
  :after lsp
  :config
  (lsp-treemacs-sync-mode 1))
#+end_src

** COMPLETION
*** Minibuffer
#+begin_src emacs-lisp
(use-package vertico 
  :ensure t 
  :init (vertico-mode))

(use-package orderless
  :ensure t
  :init
  (setq completion-styles '(orderless basic)))
#+end_src

*** In-buffer (Company)
#+begin_src emacs-lisp
(use-package company
  :ensure t
  :hook (prog-mode . company-mode)
  :bind (:map company-active-map
         ("<tab>" . company-complete-selection)
         ("C-n" . company-select-next)
         ("C-p" . company-select-previous))
  :custom
  (company-minimum-prefix-length 2)
  (company-idle-delay 0.2)
  (company-selection-wrap-around t)
  (company-tooltip-align-annotations t)
  (company-require-match nil)
  (company-backends '(company-capf)))
#+end_src

** Mode-line Cleanup
#+begin_src emacs-lisp
      ;; Hide additional minor modes from mode-line
      (use-package diminish
        :ensure t
        :config
    (diminish 'eldoc-mode)
    (diminish 'visual-line-mode))
#+end_src

** WDIRED Mode
#+begin_src emacs-lisp
  (use-package wdired
    :ensure nil
    :after dired
    :config
    (setq wdired-allow-to-change-permissions t))
#+end_src

** Drag Stuff
#+begin_src emacs-lisp
  (use-package drag-stuff
    :ensure t
    :after evil
    :hook (prog-mode . drag-stuff-mode)
    :config
    (global-set-key (kbd "C-<up>") 'drag-stuff-up)
    (global-set-key (kbd "C-<down>") 'drag-stuff-down))
#+end_src

* VERSION CONTROL
#+begin_src emacs-lisp
  (use-package transient
    :ensure t)

  (use-package magit
    :ensure t
    :commands magit-status)

  (use-package marginalia
  :ensure t
  :after vertico
  :init
  (marginalia-mode 1))

#+end_src




** Custom Function
#+begin_src emacs-lisp
     (defun batunii/load-file()
       "Load a file."
     (interactive)
     (load-file "~/.config/emacs/config.el"))

   (defun batunii/reload-config()
     "Reload the config."
     (interactive)
     (org-babel-tangle "~/.config/emacs/config.org")
     (load-file "~/.config/emacs/config.el"))

#+end_src

** Native Compilation
#+begin_src emacs-lisp
;; Enable native compilation if available
(when (and (fboundp 'native-comp-available-p)
           (native-comp-available-p))
  (setq native-comp-async-report-warnings-errors nil  ; Silence warnings
        native-comp-deferred-compilation t))  ; Compile packages in background
#+end_src

** TLDR;

#+begin_src emacs-lisp
  (use-package tldr
    :ensure t)
#+end_src

** GLSL
#+begin_src emacs-lisp
  (use-package glsl-mode
    :ensure t)
  (with-eval-after-load 'lsp-mode
  ;; Disable the old GLSL server completely
  (setq lsp-disabled-clients '(glslls))

  ;; Register glsl_analyzer explicitly
  (lsp-register-client
   (make-lsp-client
    :new-connection
    (lsp-stdio-connection
     '("/usr/local/bin/glsl_analyzer"))
    :activation-fn (lsp-activate-on "glsl")
    :server-id 'glsl-analyzer)))

#+end_src


