emacs/config.el

(add-to-list 'display-buffer-alist
             '("\\*compilation\\*"
               (display-buffer-at-bottom)
               (window-height . 0.3)))
(defun batunii/select-compilation-window (_proc)
  "Select the compilation window after it is displayed."
  (when-let ((win (get-buffer-window "*compilation*" t)))
    (select-window win)))

(add-hook 'compilation-start-hook #'batunii/select-compilation-window)
